---
kind: other
id: Properties.T:Autodesk.Revit.DB.Lighting.LightShape
source: html/28ab2a63-0580-5127-e918-70bbecadfc54.htm
---
# LightShape Properties

Specifies whether the .NET object represents a valid Revit entity.